_site/boj-18870/index.html
<div id="outline-container-org4d47952" class="outline-2">
<h2 id="org4d47952">BOJ 188770 좌표압축</h2>
</div>

<div id="outline-container-org301a9d9" class="outline-2">
<h2 id="org301a9d9">접근하기</h2>
<div class="outline-text-2" id="text-org301a9d9">
<ul class="org-ul">
<li>좌표압축을 묻는 문제</li>
</ul>
</div>
</div>

<div id="outline-container-org96341d6" class="outline-2">
<h2 id="org96341d6">코드 1</h2>
<div class="outline-text-2" id="text-org96341d6">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #8ae234; font-weight: bold;">mespace</span> <span style="color: #ff6347;">std</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;

<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Node</span>
{
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">val</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">idx</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">val2</span>;
} <span style="color: #8ae234; font-weight: bold;">Node</span>;

<span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">pool</span>[1000010];

<span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #edd400; font-weight: bold;">compare</span>(<span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">p1</span>, <span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">p2</span>)
{
    <span style="color: #729fcf; font-weight: bold;">return</span> (p1.val &lt; p2.val);
}

<span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #edd400; font-weight: bold;">compare2</span>(<span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">p1</span>, <span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">p2</span>)
{
    <span style="color: #729fcf; font-weight: bold;">return</span> (p1.idx &lt; p2.idx);
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    <span style="color: #8ae234;">ios_base</span>::sync_with_stdio(<span style="color: #8ae234;">false</span>);
    cin.tie(<span style="color: #8ae234;">NULL</span>);

    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;N);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;pool[i].val);
        pool[i].idx = i;
        pool[i].val2 = 0;
    }
    sort(pool, pool+N, compare);

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">cnt</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (i != 0 &amp;&amp; pool[i-1].val == pool[i].val) {
            pool[i].val2 = cnt-1;
        } <span style="color: #729fcf; font-weight: bold;">else</span> {
            pool[i].val2 = cnt++;
        }
    }
    sort(pool, pool+N, compare2); <span style="color: #888a85;">// </span><span style="color: #888a85;">&#51077;&#47141;&#48155;&#51008; index&#49692;&#49436;&#47196; &#51221;&#47148;&#54632;</span>
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        printf(<span style="color: #ad7fa8; font-style: italic;">"%d "</span>, pool[i].val2);
    }
    printf(<span style="color: #ad7fa8; font-style: italic;">"\n"</span>);
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org98c5b59" class="outline-2">
<h2 id="org98c5b59">코드 2 - STL</h2>
<div class="outline-text-2" id="text-org98c5b59">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;iostream&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;algorithm&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;
<span style="color: #8ae234; font-weight: bold;">vector</span>&lt;<span style="color: #8ae234; font-weight: bold;">int</span>&gt; <span style="color: #ff6347;">a</span>;
<span style="color: #8ae234; font-weight: bold;">vector</span>&lt;<span style="color: #8ae234; font-weight: bold;">int</span>&gt; <span style="color: #ff6347;">b</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;N);

    a.resize(N);
    b.resize(N);

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;a[i]);
        b[i] = a[i];
    }

    sort(a.begin(), a.end());
    a.erase(unique(a.begin(), a.end()), a.end()); 

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #729fcf; font-weight: bold;">auto</span>&amp; <span style="color: #ff6347;">c</span> : b) {
        cout &lt;&lt; lower_bound(a.begin(), a.end(), c) - a.begin() &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">" "</span>; <span style="color: #888a85;">// </span><span style="color: #888a85;">index&#47484; &#50619;&#51012; &#49688; &#51080;&#51020;</span>
    } 
    cout &lt;&lt; endl;
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org892619c" class="outline-2">
<h2 id="org892619c">참고자료</h2>
<div class="outline-text-2" id="text-org892619c">
<ul class="org-ul">
<li><a href="https://jason9319.tistory.com/356">좌표압축기법</a></li>
<li><a href="https://blog.hamayanhamayan.com/entry/2021/08/09/010106">좌표압축 설명</a></li>
</ul>
</div>
</div>

<div id="outline-container-org99b6a45" class="outline-2">
<h2 id="org99b6a45">문제 링크</h2>
<div class="outline-text-2" id="text-org99b6a45">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/18870">https://www.acmicpc.net/problem/18870</a></li>
</ul>
</div>
</div>
